tap "homebrew/bundle"
# Automatic configure script builder
brew "autoconf"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Versatile and fast Unicode/ASCII/ANSI graphics renderer
brew "chafa"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Generic library support script
brew "libtool"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Simple terminal UI for git commands
brew "lazygit"
# System to create Windows installers
brew "makensis"
# Mac App Store command-line interface
brew "mas"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# OpenSSL based Authenticode signing for PE/MSI/Java CAB files
brew "osslsigncode"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Simple terminal image viewer written in Rust
brew "viu"
cask "font-hack-nerd-font"
# System monitor for the menu bar
cask "stats"
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Microsoft Outlook", id: 985367838
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
vscode "bierner.markdown-mermaid"
vscode "bracketpaircolordlw.bracket-pair-color-dlw"
vscode "cweijan.xmind-viewer"
vscode "dbaeumer.vscode-eslint"
vscode "donjayamanne.githistory"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "emeraldwalk.runonsave"
vscode "equinusocio.vsc-material-theme"
vscode "equinusocio.vsc-material-theme-icons"
vscode "esbenp.prettier-vscode"
vscode "exponent.exponent-vscode-extension"
vscode "greatejoeylu.vscode-leetcode"
vscode "infeng.vscode-react-typescript"
vscode "jamesmaj.easy-icons"
vscode "lokalise.i18n-ally"
vscode "mhutchie.git-graph"
vscode "ms-ceintl.vscode-language-pack-zh-hant"
vscode "ms-playwright.playwright"
vscode "naumovs.color-highlight"
vscode "pkief.material-icon-theme"
vscode "remimarche.cspell-tech"
vscode "rvest.vs-code-prettier-eslint"
vscode "simonsiefke.svg-preview"
vscode "standard.vscode-standard"
vscode "streetsidesoftware.code-spell-checker"
vscode "styled-components.vscode-styled-components"
vscode "stylelint.vscode-stylelint"
